Documents/ИсходящееСообщениеОСтраховомСлучаеФСС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>ИсходящееСообщениеОСтраховомСлучаеФСС</Name>
			<BasedOn>
				<xr:Item>Document.БольничныйЛист</xr:Item>
				<xr:Item>Document.ВходящийЗапросФССДляРасчетаПособия</xr:Item>
				<xr:Item>Document.ОтветНаЗапросФССДляРасчетаПособия</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АктоваяЗаписьОРожденииДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АктоваяЗаписьОРожденииНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>22</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПособия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПособияНазначаемыеФСС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГоловнаяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДокументыОснованияИсходящегоСообщенияОСтраховомСлучаеФСС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСтрокиРеестра</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнойДокументОРожденииДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнойДокументОРожденииКемВыдан</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнойДокументОРожденииНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнойДокументОРожденииСерия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПодчиненностиФСС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЛН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСтрахователяФСС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтключитьПроверкиПроведения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтпускПоУходуДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтпускПоУходуДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Перерасчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПризнаниеСлучаяСтраховым</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПризнаниеСлучаяСтраховым</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ребенок</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.РодственникФизическогоЛица</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РебенокДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РебенокИмя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РебенокКодСвязи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РебенокОтчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РебенокПол</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПолФизическогоЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РебенокСНИЛС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РебенокФамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвидетельствоОРожденииДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвидетельствоОРожденииКемВыдано</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвидетельствоОРожденииНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвидетельствоОРожденииСерия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СотрудникДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СотрудникИмя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СотрудникКатегория</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СотрудникОтчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СотрудникСНИЛС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СотрудникФамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СправкаОРожденииДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СправкаОРожденииКемВыдана</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СправкаОРожденииНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СправкаОРожденииФорма</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ФормыСправкиОРожденииРебенка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Страхователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеXML</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветНаЗапрос</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОтветНаЗапросФССДляРасчетаПособия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФиксацияИзменений</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяРеквизита</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Путь</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ИсходящееСообщениеОСтраховомСлучаеФСС/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКопировании(ОбъектКопирования)
	ИсправленныйДокумент = ОбъектКопирования.Ссылка;
	ОтключитьПроверкиПроведения = Ложь;
	ХранилищеXML                = Неопределено;
	ДатаОтправки                = '00010101';
	ИдентификаторСообщения      = "";
КонецПроцедуры

Процедура ОбработкаЗаполнения(Основание, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(Основание) = Тип("Структура") Тогда
		Если Основание.Свойство("Действие")
			И Основание.Действие = "Исправить"
			И ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыРасширеннаяПодсистемы.ИсправленияДокументов") Тогда
			МодульИсправлениеДокументовЗарплатаКадры = ОбщегоНазначения.ОбщийМодуль("ИсправлениеДокументовЗарплатаКадры");
			МодульИсправлениеДокументовЗарплатаКадры.СкопироватьДокумент(
				ЭтотОбъект,
				Основание.Ссылка,
				,
				,
				Основание);
		Иначе
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, Основание);
			Если Не ЗначениеЗаполнено(ДокументОснование) Тогда
				Основание = ОбщегоНазначенияБЗК.ЗначениеСвойства(Основание, "Основание");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ТипЗнч(Основание) = Тип("СправочникСсылка.Сотрудники") Тогда
		Сотрудник = Основание;
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ВходящийЗапросФССДляРасчетаПособия")
		И ЗначениеЗаполнено(Основание) Тогда
		ОтветНаЗапрос = ПоследнийОтветНаЗапрос(Основание);
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ОтветНаЗапросФССДляРасчетаПособия")
		И ЗначениеЗаполнено(Основание) Тогда
		ОтветНаЗапрос = Основание;
	ИначеЕсли Метаданные().Реквизиты.ДокументОснование.Тип.СодержитТип(ТипЗнч(Основание))
		И ЗначениеЗаполнено(Основание) Тогда
		ДокументОснование = Основание;
		ОтветНаЗапрос = ПоследнийОтветНаЗапрос(Основание);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОтветНаЗапрос) Тогда
		ЗаполнитьДанныеИзОтветаНаЗапрос(Ложь);
	КонецЕсли;
	
	ЗначенияДляЗаполнения = Новый Структура("Ответственный");
	ЗарплатаКадры.ПолучитьЗначенияПоУмолчанию(ЗначенияДляЗаполнения);
	
	Если ЗначениеЗаполнено(Сотрудник) Тогда
		КадровыеДанные = КадровыеДанныеСотрудника();
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, КадровыеДанные);
	КонецЕсли;
	Если ЗначениеЗаполнено(ДокументОснование) Тогда
		ПараметрыФиксации = Документы.ИсходящееСообщениеОСтраховомСлучаеФСС.ПараметрыФиксацииВторичныхДанных();
		ЗаполнитьДанныеИзОснования(ПараметрыФиксации, Ложь);
	КонецЕсли;
	
	ОбновитьВторичныеДанные();
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	ПроверяемыеРеквизиты.Очистить();
	
	СведенияОВидеПособия = СЭДОФСС.СведенияОВидеПособия(ВидПособия);
	
	Если Перерасчет Тогда
		// Инициация перерасчета. Запрос сведений о записи реестра выплаты.
		СЭДОФСС.ПроверитьИдентификаторСтрокиРеестра(Отказ, ЭтотОбъект, "ИдентификаторСтрокиРеестра");
		
	ИначеЕсли СведенияОВидеПособия.ЭтоОтпускПоУходу Тогда
		// Отпуск по уходу за ребёнком по достижении им возраста полутора лет.
		ПроверитьСведенияОЗастрахованномЛице(Отказ, ПроверяемыеРеквизиты, СведенияОВидеПособия);
		ПроверитьИнформациюОРебенке(Отказ, ПроверяемыеРеквизиты);
		ПроверитьОснованияДляНазначенияПособия(Отказ, ПроверяемыеРеквизиты, СведенияОВидеПособия);
		ПроверитьДатуРожденияРебенка(Отказ, ПроверяемыеРеквизиты);
		
	ИначеЕсли СведенияОВидеПособия.ЭтоПособиеПриРождении Тогда
		// Рождение ребёнка.
		ПроверитьСведенияОЗастрахованномЛице(Отказ, ПроверяемыеРеквизиты, СведенияОВидеПособия);
		ПроверитьИнформациюОРебенке(Отказ, ПроверяемыеРеквизиты);
		ПроверитьОснованияДляНазначенияПособия(Отказ, ПроверяемыеРеквизиты, СведенияОВидеПособия);
		
	ИначеЕсли СведенияОВидеПособия.ЭтоЛН Тогда
		// Данные о закрытии листка нетрудоспособности.
		ПроверитьСведенияОЗастрахованномЛице(Отказ, ПроверяемыеРеквизиты, СведенияОВидеПособия);
		ПроверитьСведенияОбЭЛН(Отказ);
		
	КонецЕсли;
	
	ПроверитьСведенияОСтрахователе(Отказ, ПроверяемыеРеквизиты);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	// Заполнение недостающих полей.
	Если Не ЗначениеЗаполнено(Дата) Тогда
		Дата = ТекущаяДатаСеанса();
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ДатаСоздания) Тогда
		ДатаСоздания = ТекущаяДата(); // АПК:143 Для фильтрации событий в журнале регистрации требуется дата сервера.
	КонецЕсли;
	
	// Заполнение текста XML.
	ЭтоПроведение = (РежимЗаписи = РежимЗаписиДокумента.Проведение
		Или (Проведен И РежимЗаписи = РежимЗаписиДокумента.Запись));
	Если ЭтоПроведение Тогда
		ТекстXML = Документы.ИсходящееСообщениеОСтраховомСлучаеФСС.ТекстXML(ЭтотОбъект);
	Иначе
		ТекстXML = "";
	КонецЕсли;
	ХранилищеXML = Новый ХранилищеЗначения(ТекстXML, Новый СжатиеДанных(9));
	
	// Чтение реквизитов "До записи" для проверки и подготовки сведений к процедуре ПриЗаписи.
	ЗначенияРеквизитовДоЗаписи = ЗначенияРеквизитовДоЗаписи();
	ДополнительныеСвойства.Вставить("ЗначенияРеквизитовДоЗаписи", ЗначенияРеквизитовДоЗаписи);
	
	// Проверка отсутствия критичных изменений в отправленном документе.
	Если ЗначениеЗаполнено(ИдентификаторСообщения)
		И ЗначениеЗаполнено(ЗначенияРеквизитовДоЗаписи.ФизическоеЛицо)
		И ЗначенияРеквизитовДоЗаписи.ФизическоеЛицо <> ФизическоеЛицо Тогда
		ВызватьИсключение НСтр("ru = 'Недопустимо изменять физическое лицо в отправленном документе.'");
	КонецЕсли;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	РегистрыСведений.РегистрацииИсходящихСообщенийОСтраховыхСлучаяхФСС.ЗаполнитьПоДокументу(ЭтотОбъект);
	РегистрыСведений.СведенияОбЭЛН.ПриЗаписиИсходящегоСообщенияОСтраховомСлучае(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПередЗаписью

Функция ЗначенияРеквизитовДоЗаписи()
	ИменаРеквизитов = "Дата, НомерЛН, ГоловнаяОрганизация, ФизическоеЛицо, ПометкаУдаления, Проведен";
	ЭтоНовый = ЭтоНовый();
	Если ЭтоНовый Тогда
		Результат = ОбщегоНазначенияБЗК.ЗначенияСвойств(ЭтотОбъект, ИменаРеквизитов);
	Иначе
		Результат = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, ИменаРеквизитов);
	КонецЕсли;
	Результат.Вставить("ЭтоНовый", ЭтоНовый);
	Возврат Результат;
КонецФункции

#КонецОбласти

#Область ФиксацияВторичныхДанныхВДокументах

Функция ОбновитьВторичныеДанные(ПараметрыФиксации = Неопределено) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Модифицирован = Ложь;
	
	Если ОбъектЗафиксирован() Тогда
		Возврат Модифицирован;
	КонецЕсли;
	
	Если ПараметрыФиксации = Неопределено Тогда
		ПараметрыФиксации = Документы.ИсходящееСообщениеОСтраховомСлучаеФСС.ПараметрыФиксацииВторичныхДанных();
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Дата) Тогда
		Дата = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Если ЗаполнитьДанныеИзОтветаНаЗапрос(ПараметрыФиксации) Тогда
		Модифицирован = Истина;
	КонецЕсли;
	
	Если ЗаполнитьДанныеИзОснования(ПараметрыФиксации, Истина) Тогда
		Модифицирован = Истина;
	КонецЕсли;
	
	Если ЗаполнитьДанныеОрганизации(ПараметрыФиксации) Тогда
		Модифицирован = Истина;
	КонецЕсли;
	
	Если ЗаполнитьКадровыеДанныеСотрудника(ПараметрыФиксации) Тогда
		Модифицирован = Истина;
	КонецЕсли;
	
	Если ЗаполнитьКадровыеДанныеРебенка(ПараметрыФиксации) Тогда
		Модифицирован = Истина;
	КонецЕсли;
	
	Возврат Модифицирован;
КонецФункции

Функция ОбъектЗафиксирован() Экспорт
	Возврат Документы.ИсходящееСообщениеОСтраховомСлучаеФСС.ОбъектЗафиксирован(ЭтотОбъект);
КонецФункции

Функция ЗаполнитьДанныеИзОснования(ПараметрыФиксации, УчитыватьФиксацию) Экспорт
	Реквизиты = ДанныеОснования(ПараметрыФиксации);
	Если Реквизиты = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	Если УчитыватьФиксацию Тогда
		Если ЗначениеЗаполнено(Реквизиты.Ребенок)
			Или ФиксацияВторичныхДанныхВДокументах.РеквизитШапкиЗафиксирован(ЭтотОбъект, "Ребенок") Тогда
			Реквизиты = КоллекцииБЗК.СкопироватьСтруктуру(Реквизиты);
			КоллекцииБЗК.УдалитьКлючиСтруктуры(Реквизиты, ИменаРеквизитовЗаполняемыхИзРебенка(ПараметрыФиксации));
		КонецЕсли;
		Возврат ФиксацияВторичныхДанныхВДокументах.ОбновитьДанныеШапки(Реквизиты, ЭтотОбъект, ПараметрыФиксации);
	Иначе
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Реквизиты);
		ФиксацияВторичныхДанныхВДокументах.ОтменитьФиксациюРеквизитовШапки(ЭтотОбъект, Реквизиты);
		Возврат Истина;
	КонецЕсли;
КонецФункции

Функция ДанныеОснования(ПараметрыФиксации)
	Если Не ЗначениеЗаполнено(ДокументОснование) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	КлючКэша = "ДанныеПервичногоДокумента";
	ЗначениеИзКэша = ОбщегоНазначенияБЗК.ЗначениеСвойства(ДополнительныеСвойства, КлючКэша);
	Если ЗначениеИзКэша <> Неопределено Тогда
		Возврат ЗначениеИзКэша;
	КонецЕсли;
	
	Реквизиты = ФиксацияВторичныхДанныхВДокументахКлиентСервер.СтруктураПолейПоОснованиюЗаполнения(
		ПараметрыФиксации,
		"ДокументОснование, Ребенок");
	Реквизиты.Вставить("Организация");
	Реквизиты.Вставить("Сотрудник");
	Реквизиты.Вставить("ФизическоеЛицо");
	Реквизиты.Вставить("ВидПособия");
	Реквизиты.Вставить("Ребенок");
	Реквизиты.Вставить("ДатаНачалаСобытия");
	Реквизиты.Вставить("ИдентификаторСтрокиОснования");
	ДополнительныеСвойства.Вставить(КлючКэша, Реквизиты);
	
	МенеджерОснования = ОбщегоНазначения.МенеджерОбъектаПоСсылке(ДокументОснование);
	МенеджерОснования.ЗаполнитьИсходящееСообщениеОСтраховомСлучаеФСС(ДокументОснование, ЭтотОбъект, Реквизиты);
	
	Если ЗначениеЗаполнено(ИдентификаторСтрокиРеестра) Тогда
		Реквизиты.Удалить("ИдентификаторСтрокиРеестра");
	КонецЕсли;
	
	Если ВидПособия <> Реквизиты.ВидПособия Тогда
		Если Не ЗначениеЗаполнено(Реквизиты.ВидПособия) Тогда
			Реквизиты.Удалить("ВидПособия");
		ИначеЕсли (Реквизиты.ВидПособия = Перечисления.ПособияНазначаемыеФСС.ПособиеПоБеременностиИРодам
				Или Реквизиты.ВидПособия = Перечисления.ПособияНазначаемыеФСС.ПособиеПоБеременностиИРодамВставшимНаУчетВРанниеСроки
				Или Реквизиты.ВидПособия = Перечисления.ПособияНазначаемыеФСС.ЕдиновременноеПособиеПриРожденииРебенка)
			И (ВидПособия = Перечисления.ПособияНазначаемыеФСС.ПособиеПоБеременностиИРодам
				Или ВидПособия = Перечисления.ПособияНазначаемыеФСС.ПособиеПоБеременностиИРодамВставшимНаУчетВРанниеСроки
				Или ВидПособия = Перечисления.ПособияНазначаемыеФСС.ЕдиновременноеПособиеПриРожденииРебенка) Тогда
			Реквизиты.Удалить("ВидПособия");
		КонецЕсли;
	КонецЕсли;
	
	Возврат Реквизиты;
КонецФункции

Функция ЗаполнитьДанныеОрганизации(ПараметрыФиксации)
	// Головная организация заполняется безусловно, т.к. определяет права.
	ГоловнаяОрганизация = ЗарплатаКадры.ГоловнаяОрганизация(Организация);
	
	Реквизиты = Новый Структура("Страхователь, НомерСтрахователяФСС, КодПодчиненностиФСС");
	Если ФиксацияВторичныхДанныхВДокументах.РеквизитыШапкиЗафиксированы(ЭтотОбъект, Реквизиты) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Организация) Тогда
		ИменаПолей = "НомерСтрахователяФСС, КодПодчиненностиФСС";
		Сведения = СЭДОФСС.СведенияОСтрахователе(Организация, ИменаПолей, Дата);
		Реквизиты.Страхователь         = Сведения.Страхователь;
		Реквизиты.НомерСтрахователяФСС = Сведения.НомерСтрахователяФСС;
		Реквизиты.КодПодчиненностиФСС  = Сведения.КодПодчиненностиФСС;
	КонецЕсли;
	
	Возврат ФиксацияВторичныхДанныхВДокументах.ОбновитьДанныеШапки(Реквизиты, ЭтотОбъект, ПараметрыФиксации);
КонецФункции

Функция ЗаполнитьКадровыеДанныеСотрудника(ПараметрыФиксации)
	Реквизиты = Новый Структура(
		"СотрудникФамилия,
		|СотрудникИмя,
		|СотрудникОтчество,
		|СотрудникДатаРождения,
		|СотрудникКатегория,
		|СотрудникСНИЛС");
	
	КадровыеДанные = КадровыеДанныеСотрудника();
	Если КадровыеДанные <> Неопределено Тогда
		РеквизитыФизическоеЛицо         = КадровыеДанные.ФизическоеЛицо;
		Реквизиты.СотрудникФамилия      = КадровыеДанные.Фамилия;
		Реквизиты.СотрудникИмя          = КадровыеДанные.Имя;
		Реквизиты.СотрудникОтчество     = КадровыеДанные.Отчество;
		Реквизиты.СотрудникДатаРождения = КадровыеДанные.ДатаРождения;
		Реквизиты.СотрудникСНИЛС        = КадровыеДанные.СтраховойНомерПФР;
	Иначе
		РеквизитыФизическоеЛицо = Справочники.ФизическиеЛица.ПустаяСсылка();
	КонецЕсли;
	
	Реквизиты.СотрудникКатегория = "INSURED"; // См. СЭДОФСС.СписокВыбораКатегорийЗастрахованныхЛиц.
	
	ЕстьИзменения = Ложь;
	Если ФиксацияВторичныхДанныхВДокументах.ОбновитьДанныеШапки(Реквизиты, ЭтотОбъект, ПараметрыФиксации) Тогда
		ЕстьИзменения = Истина;
	КонецЕсли;
	Если ФизическоеЛицо <> РеквизитыФизическоеЛицо Тогда
		ФизическоеЛицо = РеквизитыФизическоеЛицо; // ФизическоеЛицо заполняется безусловно, т.к. определяет права.
		ЕстьИзменения = Истина;
	КонецЕсли;
	
	Возврат ЕстьИзменения;
КонецФункции

Функция КадровыеДанныеСотрудника()
	КадровыеДанныеСотрудника = ОбщегоНазначенияБЗК.ЗначениеСвойства(ДополнительныеСвойства, "КадровыеДанные");
	Если КадровыеДанныеСотрудника = Неопределено Тогда
		Если Не ЗначениеЗаполнено(Сотрудник) Тогда
			Возврат Неопределено;
		КонецЕсли;
		ИменаПолей = Документы.ИсходящееСообщениеОСтраховомСлучаеФСС.ИменаПолейТребуемыхКадровыхДанных();
		КадровыеДанныеСотрудника = КадровыйУчет.КадровыеДанныеСотрудника(Истина, Сотрудник, ИменаПолей, Дата);
		Если КадровыеДанныеСотрудника = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;
	КонецЕсли;
	Если ТипЗнч(КадровыеДанныеСотрудника) = Тип("Структура") Тогда
		Возврат КадровыеДанныеСотрудника;
	КонецЕсли;
	ИменаПолей = Документы.ИсходящееСообщениеОСтраховомСлучаеФСС.ИменаПолейТребуемыхКадровыхДанных();
	КадровыеДанные = Новый Структура(ИменаПолей);
	ЗаполнитьЗначенияСвойств(КадровыеДанные, КадровыеДанныеСотрудника);
	ДополнительныеСвойства.Вставить("КадровыеДанные", КадровыеДанные);
	Возврат КадровыеДанные;
КонецФункции

Функция ЗаполнитьКадровыеДанныеРебенка(ПараметрыФиксации)
	Реквизиты = Новый Структура(ИменаРеквизитовЗаполняемыхИзРебенка(ПараметрыФиксации));
	
	Если ЗначениеЗаполнено(Ребенок) Тогда
		КадровыеДанныеРебенка = СЭДОФСС.КадровыеДанныеРодственника(Ребенок, Истина);
		Реквизиты.РебенокФамилия      = КадровыеДанныеРебенка.Фамилия;
		Реквизиты.РебенокИмя          = КадровыеДанныеРебенка.Имя;
		Реквизиты.РебенокОтчество     = КадровыеДанныеРебенка.Отчество;
		Реквизиты.РебенокДатаРождения = КадровыеДанныеРебенка.ДатаРождения;
		Реквизиты.РебенокСНИЛС        = КадровыеДанныеРебенка.СНИЛС;
		Реквизиты.РебенокКодСвязи     = КадровыеДанныеРебенка.КодСвязи;
		Реквизиты.РебенокПол          = КадровыеДанныеРебенка.Пол;
	ИначеЕсли ЗначениеЗаполнено(ДокументОснование) Или ЗначениеЗаполнено(ОтветНаЗапрос) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат ФиксацияВторичныхДанныхВДокументах.ОбновитьДанныеШапки(Реквизиты, ЭтотОбъект, ПараметрыФиксации);
КонецФункции

Функция ИменаРеквизитовЗаполняемыхИзРебенка(ПараметрыФиксации)
	ИменаПолей = ФиксацияВторичныхДанныхВДокументахКлиентСервер.ИменаПолейПоОснованиямЗаполнения(ПараметрыФиксации);
	Возврат СтрСоединить(ИменаПолей.Ребенок, ", ");
КонецФункции

Функция ЗаполнитьДанныеИзОтветаНаЗапрос(ПараметрыФиксации)
	Если Не ЗначениеЗаполнено(ОтветНаЗапрос) Тогда
		Возврат Ложь;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЕСТЬNULL(РегистрацияОтвета.Зарегистрирован, ЛОЖЬ)
	|		И РегистрацияОтвета.РегистрацияНомерРеестра <> """" КАК Перерасчет,
	|	Ответ.Сотрудник КАК Сотрудник,
	|	Ответ.Организация КАК Организация,
	|	ЕСТЬNULL(РегистрацияОтвета.Зарегистрирован, ЛОЖЬ) КАК Зарегистрирован,
	|	ЕСТЬNULL(РегистрацияОтвета.РегистрацияНомерРеестра, """") КАК ИдентификаторСтрокиРеестра,
	|	Ответ.ВидПособия КАК ВидПособия,
	|	Ответ.ДатаНачалаСобытия КАК ДатаНачалаСобытия,
	|	Ответ.ПервичныйДокумент КАК ДокументОснование,
	|	Ответ.ИнойДокументОРожденииДатаВыдачи КАК ИнойДокументОРожденииДатаВыдачи,
	|	Ответ.ИнойДокументОРожденииНомер КАК ИнойДокументОРожденииНомер,
	|	Ответ.ИнойДокументОРожденииСерия КАК ИнойДокументОРожденииСерия,
	|	Ответ.ИнойДокументОРожденииСерияНомер КАК ИнойДокументОРожденииСерияНомер,
	|	Ответ.КодПодчиненностиФСС КАК КодПодчиненностиФСС,
	|	Ответ.НомерЛН КАК НомерЛН,
	|	Ответ.НомерСтрахователяФСС КАК НомерСтрахователяФСС,
	|	Ответ.ОтпускПоУходуДатаНачала КАК ОтпускПоУходуДатаНачала,
	|	Ответ.ОтпускПоУходуДатаОкончания КАК ОтпускПоУходуДатаОкончания,
	|	Ответ.ПризнаниеСлучаяСтраховым КАК ПризнаниеСлучаяСтраховым,
	|	Ответ.Ребенок КАК Ребенок,
	|	Ответ.РебенокДатаРождения КАК РебенокДатаРождения,
	|	Ответ.РебенокИмя КАК РебенокИмя,
	|	Ответ.РебенокКодСвязи КАК РебенокКодСвязи,
	|	Ответ.РебенокОтчество КАК РебенокОтчество,
	|	Ответ.РебенокПол КАК РебенокПол,
	|	Ответ.РебенокСНИЛС КАК РебенокСНИЛС,
	|	Ответ.РебенокФамилия КАК РебенокФамилия,
	|	Ответ.СвидетельствоОРожденииДатаВыдачи КАК СвидетельствоОРожденииДатаВыдачи,
	|	Ответ.СвидетельствоОРожденииНомер КАК СвидетельствоОРожденииНомер,
	|	Ответ.СвидетельствоОРожденииСерия КАК СвидетельствоОРожденииСерия,
	|	Ответ.СотрудникДатаРождения КАК СотрудникДатаРождения,
	|	Ответ.СотрудникИмя КАК СотрудникИмя,
	|	Ответ.СотрудникКатегория КАК СотрудникКатегория,
	|	Ответ.СотрудникОтчество КАК СотрудникОтчество,
	|	Ответ.СотрудникСНИЛС КАК СотрудникСНИЛС,
	|	Ответ.СотрудникФамилия КАК СотрудникФамилия,
	|	Ответ.СправкаОРожденииДатаВыдачи КАК СправкаОРожденииДатаВыдачи,
	|	Ответ.СправкаОРожденииНомер КАК СправкаОРожденииНомер,
	|	Ответ.СправкаОРожденииФорма КАК СправкаОРожденииФорма
	|ИЗ
	|	Документ.ОтветНаЗапросФССДляРасчетаПособия КАК Ответ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РегистрацииОтветовНаЗапросыФССДляРасчетаПособий КАК РегистрацияОтвета
	|		ПО (РегистрацияОтвета.ИсходящийДокумент = Ответ.Ссылка)
	|ГДЕ
	|	Ответ.Ссылка = &ОтветНаЗапрос";
	Запрос.УстановитьПараметр("ОтветНаЗапрос", ОтветНаЗапрос);
	Таблица = Запрос.Выполнить().Выгрузить();
	Если Таблица.Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	РеквизитыОтвета = ОбщегоНазначения.ТаблицаЗначенийВМассив(Таблица)[0];
	Если Не РеквизитыОтвета.Зарегистрирован Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(РеквизитыОтвета.ИдентификаторСтрокиРеестра)
		И СтрНайти(РеквизитыОтвета.ИдентификаторСтрокиРеестра, ":") = 0 Тогда
		РеквизитыОтвета.ИдентификаторСтрокиРеестра = РеквизитыОтвета.ИдентификаторСтрокиРеестра + ":1";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДокументОснование) Тогда
		РеквизитыОснования = ДанныеОснования(ПараметрыФиксации);
		КоллекцииБЗК.УдалитьКлючиСтруктуры(РеквизитыОтвета, РеквизитыОснования);
	КонецЕсли;
	Если ЗначениеЗаполнено(ДокументОснование) Или ЗначениеЗаполнено(Ребенок) Тогда
		РеквизитыРебенка = Новый Структура(ИменаРеквизитовЗаполняемыхИзРебенка(ПараметрыФиксации));
		КоллекцииБЗК.УдалитьКлючиСтруктуры(РеквизитыОтвета, РеквизитыРебенка);
	КонецЕсли;
	
	Возврат ФиксацияВторичныхДанныхВДокументах.ОбновитьДанныеШапки(РеквизитыОтвета, ЭтотОбъект, ПараметрыФиксации);
КонецФункции

Функция ПоследнийОтветНаЗапрос(Основание)
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Ответ.Ссылка КАК Ссылка,
	|	Ответ.Дата КАК Дата,
	|	ЕСТЬNULL(Ответ.ДатаОтправки, РегистрацияОтвета.ДатаОтправки) КАК ДатаОтправки,
	|	Ответ.Сотрудник КАК Сотрудник,
	|	Ответ.Организация КАК Организация,
	|	Ответ.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	Ответ.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ЕСТЬNULL(РегистрацияОтвета.Доставлен, ЛОЖЬ) КАК Доставлен,
	|	ЕСТЬNULL(РегистрацияОтвета.Зарегистрирован, ЛОЖЬ) КАК Зарегистрирован,
	|	ЕСТЬNULL(РегистрацияОтвета.РегистрацияНомерРеестра, """") КАК РегистрацияНомерРеестра
	|ИЗ
	|	Документ.ОтветНаЗапросФССДляРасчетаПособия КАК Ответ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РегистрацииОтветовНаЗапросыФССДляРасчетаПособий КАК РегистрацияОтвета
	|		ПО (РегистрацияОтвета.ИсходящийДокумент = Ответ.Ссылка)
	|ГДЕ
	|	Ответ.ВходящийЗапрос = &Основание
	|	И Ответ.Проведен = ИСТИНА
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаОтправки УБЫВ,
	|	Зарегистрирован УБЫВ,
	|	Доставлен УБЫВ,
	|	Дата УБЫВ";
	Запрос.УстановитьПараметр("Основание", Основание);
	Если ТипЗнч(Основание) <> Тип("ДокументСсылка.ВходящийЗапросФССДляРасчетаПособия") Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,
			"Ответ.ВходящийЗапрос = &Основание",
			"Ответ.ПервичныйДокумент = &Основание");
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции

#КонецОбласти

#Область ОбработкаПроверкиЗаполнения

Процедура ПроверитьСведенияОбЭЛН(Отказ)
	ПроверкиБЗК.ПроверитьНомерЛН(Отказ, ЭтотОбъект, "НомерЛН");
КонецПроцедуры

Процедура ПроверитьСведенияОЗастрахованномЛице(Отказ, ПроверяемыеРеквизиты, СведенияОВидеПособия)
	
	ПроверкиБЗК.ПроверитьСНИЛС(Отказ, ЭтотОбъект, "СотрудникСНИЛС");
	
	Если СведенияОВидеПособия.ЭтоОтпускПоУходу Или СведенияОВидеПособия.ЭтоПособиеПриРождении Тогда
		ПроверяемыеРеквизиты.Добавить("СотрудникФамилия");
		ПроверяемыеРеквизиты.Добавить("СотрудникИмя");
		ПроверяемыеРеквизиты.Добавить("СотрудникДатаРождения");
		ПроверяемыеРеквизиты.Добавить("РебенокКодСвязи");
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьИнформациюОРебенке(Отказ, ПроверяемыеРеквизиты)
	
	ПроверяемыеРеквизиты.Добавить("РебенокФамилия");
	ПроверяемыеРеквизиты.Добавить("РебенокИмя");
	ПроверяемыеРеквизиты.Добавить("РебенокДатаРождения");
	
	ПроверкиБЗК.ПроверитьСНИЛС(Отказ, ЭтотОбъект, "РебенокСНИЛС");
	
КонецПроцедуры

Процедура ПроверитьДатуРожденияРебенка(Отказ, ПроверяемыеРеквизиты)
	Если ЗначениеЗаполнено(РебенокДатаРождения)
		И ЗначениеЗаполнено(ОтпускПоУходуДатаНачала)
		И НачалоДня(РебенокДатаРождения) > ОтпускПоУходуДатаНачала Тогда
		Текст = НСтр("ru = 'Дата начала отпуска не может быть меньше даты рождения ребенка'");
		СообщенияБЗК.СообщитьОбОшибкеВОбъекте(Отказ, ЭтотОбъект, Текст, "РебенокДатаРождения");
	КонецЕсли;
КонецПроцедуры

Процедура ПроверитьОснованияДляНазначенияПособия(Отказ, ПроверяемыеРеквизиты, СведенияОВидеПособия)
	
	Если СведенияОВидеПособия.ЭтоОтпускПоУходу Тогда
		ПроверкиБЗК.ПроверитьПериод(
			Отказ,
			ЭтотОбъект,
			"ОтпускПоУходуДатаНачала",
			"ОтпускПоУходуДатаОкончания",
			НСтр("ru = 'отпуска по уходу'"),
			Истина);
	КонецЕсли;
	
	ЕстьСвидетельствоОРождении = (
			ЗначениеЗаполнено(СвидетельствоОРожденииСерия)
		Или ЗначениеЗаполнено(СвидетельствоОРожденииНомер)
		Или ЗначениеЗаполнено(СвидетельствоОРожденииДатаВыдачи));
	ЕстьСправкаОРождении = СведенияОВидеПособия.ЭтоПособиеПриРождении
			И  (ЗначениеЗаполнено(СправкаОРожденииФорма)
			Или ЗначениеЗаполнено(СправкаОРожденииНомер));
	ЕстьИнойДокументОРождении = (
			ЗначениеЗаполнено(ИнойДокументОРожденииДатаВыдачи)
		Или ЗначениеЗаполнено(ИнойДокументОРожденииНомер));
	
	// Свидетельство о рождении.
	Если ЕстьСвидетельствоОРождении
		Или (Не ЕстьСправкаОРождении И Не ЕстьИнойДокументОРождении) Тогда
		ПроверяемыеРеквизиты.Добавить("СвидетельствоОРожденииСерия");
		ПроверяемыеРеквизиты.Добавить("СвидетельствоОРожденииНомер");
		ПроверяемыеРеквизиты.Добавить("СвидетельствоОРожденииДатаВыдачи");
		ПроверяемыеРеквизиты.Добавить("СвидетельствоОРожденииКемВыдано");
	КонецЕсли;
	
	// Справка о рождении.
	Если ЕстьСправкаОРождении Тогда
		ПроверяемыеРеквизиты.Добавить("СправкаОРожденииФорма");
		ПроверяемыеРеквизиты.Добавить("СправкаОРожденииНомер");
		ПроверяемыеРеквизиты.Добавить("СправкаОРожденииДатаВыдачи");
		ПроверяемыеРеквизиты.Добавить("СправкаОРожденииКемВыдана");
	КонецЕсли;
	
	// Иной документ подтверждающий рождение ребенка.
	Если ЕстьИнойДокументОРождении Тогда
		ПроверяемыеРеквизиты.Добавить("ИнойДокументОРожденииНомер");
		ПроверяемыеРеквизиты.Добавить("ИнойДокументОРожденииДатаВыдачи");
		ПроверяемыеРеквизиты.Добавить("ИнойДокументОРожденииКемВыдан");
	КонецЕсли;
	
	// Актовая запись ЗАГС.
	Если ЗначениеЗаполнено(АктоваяЗаписьОРожденииНомер)
		Или ЗначениеЗаполнено(АктоваяЗаписьОРожденииДата) Тогда
		ПроверяемыеРеквизиты.Добавить("АктоваяЗаписьОРожденииНомер");
		ПроверяемыеРеквизиты.Добавить("АктоваяЗаписьОРожденииДата");
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьСведенияОСтрахователе(Отказ, ПроверяемыеРеквизиты)
	ПроверкиБЗК.ПроверитьРегистрационныйНомерФСС(Отказ, ЭтотОбъект, "НомерСтрахователяФСС");
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
